Repository: doquangthang-zet/Treasure-Race
Catalog: Treasure Race/Views/*.lproj/Localizable.strings
Languages: vi

source: Continue
vi: Tiếp tục

# start-button
source: New Game
vi: Bắt Đầu

source: Leaderboard
vi: Xếp Hạng

source: How To Play
vi: Cách Chơi

source: Settings
vi: Cài Đặt

source: Choose Game Type
vi: Chọn hình thức

source: Play With Machine
vi: Đấu với máy

# machine-des
source: Play with your Iphone
vi: Chơi với máy Iphone

# share-des
source: Share your Iphone with friend
vi: Chia sẻ Iphone với bạn bè

source: Share Your Device
vi: Đấu với bạn

source: Choose Your Character
vi: Chọn Nhân Vật

# choose-opponent-character
source: Choose Opponent Avatar
vi: Chọn Nhân Vật

source: Your name
vi: Tên bạn

source: Opponent name
vi: Tên đối thủ

source: Start Game
vi: Vào game

source: Choose player go first
vi: Chọn người chơi bắt đầu

source: Score
vi: Điểm

source: GAME OVER
vi: KẾT THÚC

# winner
source: The winner is
vi: Người thắng là

# see-you
source: See you later!
vi: Hẹn gặp lại!

source: New game
vi: Chơi mới

source: Next level
vi: Vòng sau

source: Choose difficulty
vi: Chọn Độ Khó

source: Easy
vi: Dễ

source: Medium
vi: Trung Bình

source: Hard
vi: Khó

# easy-des
source: The road is short and a little obstacles
vi: Bản đồ ngắn và ít chướng ngoại vật

# medium-des
source: Longer road
vi: Đường dài hơn

# hard-des
source: Longer road and more obstacles
vi: Đường dài hơn và nhiều chướng ngại

source: Choose Language
vi: Chọn Ngôn Ngữ

source: Change Theme
vi: Đổi giao diện

source: Light
vi: Sáng

source: Dark
vi: Tối

# way-to-play-1
source: This is a simple dice game in which two players try to outrun each other to reach the treasure first. To start the game, players need to enter their name, select an avatar and select the game type. The game supports 2 different game types, in which players can play against the computer or share the device with another player.
vi: Đây là một trò chơi xúc xắc đơn giản, trong đó hai người chơi cố gắng chạy nhanh hơn nhau để đến được kho báu trước. Để bắt đầu trò chơi, người chơi cần nhập tên của mình, chọn hình đại diện và chọn loại trò chơi. Trò chơi hỗ trợ 2 loại trò chơi khác nhau, trong đó người chơi có thể đấu với máy tính hoặc chia sẻ thiết bị với người chơi khác.

# way-to-play-2
source: Below is the main interface of the game:
vi: Dưới đây là giao diện chính của trò chơi:

# way-to-play-3
source: First, the user needs to decide who goes first by choosing one of the two buttons with the player's name at the top of the screen.
vi: Đầu tiên, người dùng cần quyết định xem ai đi trước bằng cách chọn một trong các hai nút có tên người chơi ở đầu màn hình.

# way-to-play-4
source: Below we can see the status bars of players 1 and 2 as follows:
vi: Dưới đây chúng ta có thể thấy các thanh trạng thái của người chơi 1 và 2 như sau:

# way-to-play-5
source: The status bar includes each player's name, avatar, score and dice. When it's their turn, the player will click on the dice icon to roll, the results returned corresponding to the number of steps that the player will make.
vi: Thanh trạng thái bao gồm tên, hình đại diện, điểm số và xúc xắc của mỗi người chơi. Khi đến lượt của mình, người chơi sẽ bấm vào biểu tượng xúc xắc để tung, kết quả trả về tương ứng với số bước mà người chơi sẽ thực hiện.

# way-to-play-6
source: Below area shows treasure maps and milestones, where the first square is the starting point.
vi: Khu vực này hiển thị bản đồ kho báu và các cột mốc, trong đó ô vuông đầu tiên là điểm bắt đầu.

# way-to-play-7
source: When the player has not entered the starting square, they need to roll the dice with a result of 1 or 6 to advance to the starting square. When enter the start square, player get the Begginer medal and 100 point. After that, the player will be given another turn. The game ends when one of the two players reaches the final point with the treasure icon. At this time, the winner get the Winner medal and 100 points
vi: Khi người chơi chưa vào ô xuất phát, người chơi cần tung xúc xắc có kết quả là 1 hoặc 6 để tiến về ô xuất phát. Khi tiến vào ô xuất phát, người chơi có thể nhận 100 điểm và huuy chương Beginner. Sau đó, người chơi sẽ có một lượt khác. Trò chơi kết thúc khi một trong hai người chơi đạt đến điểm cuối cùng với biểu tượng kho báu. Khi chạm tới kho báu người chơi nhận huy chương Winner và 100 điểm

# way-to-play-8
source: Along the way, there are a few obstacles that players must pay attention to:
vi: Trên đường đi, có một số chướng ngại vật mà người chơi phải chú ý:

# way-to-play-10
source: When entering this icon, the player will be killed and kicked out of the track.
vi: Khi vào biểu tượng này người chơi sẽ bị giết và đuổi khỏi đường đua.

# way-to-play-11
source: 2. Portal:
vi: 2. Cổng dịch chuyển:

# way-to-play-12
source: With the portal icon, the player will be moved to a different cell with the same icon.
vi: Với biểu tượng cổng thông tin, người chơi sẽ được chuyển sang ô khác có biểu tượng giống vậy.

# way-to-play-13
source: 3. Three Plus:
vi: 3. Cộng 3 bước:

# way-to-play-14
source: The 'plus 3' icon allows the player to advance 3 cells.
vi: Biểu tượng 'cộng 3' cho phép người chơi tiến lên 3 ô.

# way-to-play-15
source: 4. Two Minus:
vi: 4. Trừ 2 bước:

# way-to-play-16
source: The 'minus 2' icon makes the player move 2 cells back.
vi: Biểu tượng 'trừ 2' khiến người chơi lùi lại 2 ô.

# way-to-play-17
source: Additionally, the game allows players to overtake their opponents, however, if a player encounters their opponent on the same square, they can kick them off the track. When you kick another player you can get 100 score and get the kicker(second) medal
vi: Ngoài ra, trò chơi cho phép người chơi vượt qua đối thủ, tuy nhiên, nếu người chơi gặp đối thủ của họ trên cùng một ô vuông, họ có thể đuổi chúng ra khỏi đường đua. Khi bạn đá người chơi khác bạn nhận 100 điểm và huân chương Kicker
